In [172]:
import pandas as pd
import numpy as np 
from scipy.stats import spearmanr
import matplotlib.pyplot as plt
import seaborn as sns
df=pd.read_csv("train.csv")
df2=pd.read_csv("train.csv")
df3=df2['RoomService']
dft=pd.read_csv("test.csv")
df.head()
df=df.drop("PassengerId",axis=1)
dft=dft.drop("PassengerId",axis=1)
df.head()
df.dropna(subset=["HomePlanet","CryoSleep","Destination"],inplace=True)
dft.dropna(subset=["HomePlanet","CryoSleep","Destination"],inplace=True)
df.info()
df.drop("Cabin",axis=1,inplace=True)
dft.drop("Cabin",axis=1,inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8103 entries, 0 to 8692
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   HomePlanet    8103 non-null   object
 1   CryoSleep     8103 non-null   object
 2   Cabin         7920 non-null   object
 3   Destination   8103 non-null   object
 4   Age           7930 non-null   float64
 5   VIP           7913 non-null   object
 6   RoomService   7933 non-null   float64
 7   FoodCourt     7931 non-null   float64
 8   ShoppingMall  7915 non-null   float64
 9   Spa           7930 non-null   float64
 10  VRDeck        7925 non-null   float64
 11  Name          7924 non-null   object
 12  Transported   8103 non-null   bool
dtypes: bool(1), float64(6), object(6)
memory usage: 830.9+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 8103 entries, 0 to 8692
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   HomePlanet    8103 non-null   object
 1   CryoSleep     8103 non-null   object
 2   Destination   8103 non-null   object
 3   Age           7930 non-null   float64
 4   VIP           7913 non-null   object
 5   RoomService   7933 non-null   float64
 6   FoodCourt     7931 non-null   float64
 7   ShoppingMall  7915 non-null   float64
 8   Spa           7930 non-null   float64
 9   VRDeck        7925 non-null   float64
 10  Name          7924 non-null   object
 11  Transported   8103 non-null   bool
dtypes: bool(1), float64(6), object(5)
memory usage: 767.6+ KB

In [173]:
dft.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4013 entries, 0 to 4276
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   HomePlanet    4013 non-null   object
 1   CryoSleep     4013 non-null   object
 2   Destination   4013 non-null   object
 3   Age           3932 non-null   float64
 4   VIP           3925 non-null   object
 5   RoomService   3933 non-null   float64
 6   FoodCourt     3909 non-null   float64
 7   ShoppingMall  3923 non-null   float64
 8   Spa           3922 non-null   float64
 9   VRDeck        3942 non-null   float64
 10  Name          3923 non-null   object
dtypes: float64(6), object(5)
memory usage: 376.2+ KB

In [174]:
df.describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
count,7930.000000,7933.000000,7931.000000,7915.000000,7930.000000,7925.000000
mean,28.823077,225.691668,465.534485,175.589893,312.912989,307.333628
std,14.515589,671.944468,1642.451492,614.068765,1138.148433,1159.971824
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,19.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,38.000000,47.000000,77.500000,28.000000,61.000000,46.000000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000

In [175]:
df["Age"].fillna(df["Age"].mean(),inplace=True)
dft["Age"].fillna(dft["Age"].mean(),inplace=True)
df["Age"].median()

27.0

In [176]:
df["HomePlanet"].unique()

array(['Europa', 'Earth', 'Mars'], dtype=object)

In [177]:

df1=df[["HomePlanet","VIP"]]
matrix=df1.pivot_table(index="HomePlanet",columns="VIP",aggfunc="size",fill_value=0)
matrix

VIP         False  True
HomePlanet
Earth        4284      0
Europa       1870    126
Mars         1570     63

In [178]:
cond1=df['HomePlanet']=='Earth'
cond2=df['VIP'].isna()
df.loc[cond1 & cond2 , 'VIP']=False

In [179]:
dft.head()

,HomePlanet,CryoSleep,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Name
0,Earth,True,TRAPPIST-1e,27.0,False,0.0,0.0,0.0,0.0,0.0,Nelly Carsoning
1,Earth,False,TRAPPIST-1e,19.0,False,0.0,9.0,0.0,2823.0,0.0,Lerome Peckers
2,Europa,True,55 Cancri e,31.0,False,0.0,0.0,0.0,0.0,0.0,Sabih Unhearfus
3,Europa,False,TRAPPIST-1e,38.0,False,0.0,6652.0,0.0,181.0,585.0,Meratz Caltilter
4,Earth,False,TRAPPIST-1e,20.0,False,10.0,0.0,635.0,0.0,0.0,Brence Harperez

In [180]:
cond1=dft['HomePlanet']=='Earth'
cond2=dft['VIP'].isna()
dft.loc[cond1 & cond2 , 'VIP']=False

In [181]:
cond1=df['HomePlanet']=='Mars'
cond2=df['VIP'].isna()
df.loc[(cond1)&(cond2),'VIP']=False

In [182]:
cond1=dft['HomePlanet']=='Mars'
cond2=dft['VIP'].isna()
dft.loc[(cond1)&(cond2),'VIP']=False

In [183]:
df.dropna(subset=['VIP'],inplace=True)
dft.dropna(subset=['VIP'],inplace=True)

In [184]:
df['RoomService'].isna().sum()

170

In [185]:
roomservicemean=df['RoomService'].mean()
roomservicemode=df['RoomService'].mode()
roomservicemode

0    0.0
Name: RoomService, dtype: float64

In [186]:
roomservicemeant=dft['RoomService'].mean()
roomservicemodet=dft['RoomService'].mode()

In [187]:
cond1=df['VIP']==True
cond2=df['RoomService'].isna()
df.loc[(cond1)&(cond2),'RoomService']=roomservicemean
df.shape

(8061, 12)

In [188]:
cond1=dft['VIP']==True
cond2=dft['RoomService'].isna()
dft.loc[(cond1)&(cond2),'RoomService']=roomservicemeant

In [189]:

df['RoomService'].shape

(8061,)

In [190]:
df['RoomService'].isna().sum()

166

In [191]:

df['RoomService'].shape
df['RoomService'].fillna(0,inplace=True)
dft['RoomService'].fillna(0,inplace=True)

In [192]:

df = df.loc[:, ~df.columns.duplicated(keep='first')]

In [193]:
dft.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3982 entries, 0 to 4276
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   HomePlanet    3982 non-null   object
 1   CryoSleep     3982 non-null   object
 2   Destination   3982 non-null   object
 3   Age           3982 non-null   float64
 4   VIP           3982 non-null   object
 5   RoomService   3982 non-null   float64
 6   FoodCourt     3879 non-null   float64
 7   ShoppingMall  3892 non-null   float64
 8   Spa           3892 non-null   float64
 9   VRDeck        3911 non-null   float64
 10  Name          3893 non-null   object
dtypes: float64(6), object(5)
memory usage: 373.3+ KB

In [194]:
cond1=df['VIP']==True
cond2=df['FoodCourt'].isna()
df.loc[(cond1)&(cond2),'FoodCourt']=df['FoodCourt'].mean()

In [195]:
cond1=dft['VIP']==True
cond2=dft['FoodCourt'].isna()
dft.loc[(cond1)&(cond2),'FoodCourt']=dft['FoodCourt'].mean()

In [196]:
df['FoodCourt'].fillna(0,inplace=True)
dft['FoodCourt'].fillna(0,inplace=True)

In [197]:
(df['ShoppingMall']==0).sum()

5171

In [198]:
df['ShoppingMall'].fillna(0,inplace=True)
dft['ShoppingMall'].fillna(0,inplace=True)

In [199]:
(df['Spa']==0).sum()
df['Spa'].fillna(0,inplace=True)
df.drop(['Name'],axis=1,inplace=True)
dft['Spa'].fillna(0,inplace=True)
dft.drop(['Name'],axis=1,inplace=True)

In [200]:
(df['VRDeck']==0).sum()
df['VRDeck'].fillna(0,inplace=True)
dft['VRDeck'].fillna(0,inplace=True)

In [201]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8061 entries, 0 to 8692
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   HomePlanet    8061 non-null   object
 1   CryoSleep     8061 non-null   object
 2   Destination   8061 non-null   object
 3   Age           8061 non-null   float64
 4   VIP           8061 non-null   object
 5   RoomService   8061 non-null   float64
 6   FoodCourt     8061 non-null   float64
 7   ShoppingMall  8061 non-null   float64
 8   Spa           8061 non-null   float64
 9   VRDeck        8061 non-null   float64
 10  Transported   8061 non-null   bool
dtypes: bool(1), float64(6), object(4)
memory usage: 700.6+ KB

In [202]:
df.describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
count,8061.000000,8061.000000,8061.000000,8061.000000,8061.000000,8061.000000
mean,28.787172,220.385694,449.804705,172.282471,304.297358,297.167349
std,14.350389,660.302733,1607.724261,608.932894,1124.150516,1137.301944
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,20.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,37.000000,42.000000,61.000000,23.000000,53.000000,39.000000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000

In [203]:
df.head()

,HomePlanet,CryoSleep,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Transported
0,Europa,False,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,False
1,Earth,False,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,True
2,Europa,False,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,False
3,Europa,False,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,3329.0,193.0,False
4,Earth,False,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,565.0,2.0,True

In [204]:
df['CryoSleep']= df['CryoSleep'].apply(lambda x: 1 if x==True else 0)
dft['CryoSleep']= dft['CryoSleep'].apply(lambda x: 1 if x==True else 0)

In [205]:
header=["VIP","Transported"]
df[header]=df[header].applymap(lambda x: 1 if x==True else 0)
dft["VIP"]=dft["VIP"].apply(lambda x: 1 if x==True else 0)

In [206]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8061 entries, 0 to 8692
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   HomePlanet    8061 non-null   object
 1   CryoSleep     8061 non-null   int64
 2   Destination   8061 non-null   object
 3   Age           8061 non-null   float64
 4   VIP           8061 non-null   int64
 5   RoomService   8061 non-null   float64
 6   FoodCourt     8061 non-null   float64
 7   ShoppingMall  8061 non-null   float64
 8   Spa           8061 non-null   float64
 9   VRDeck        8061 non-null   float64
 10  Transported   8061 non-null   int64
dtypes: float64(6), int64(3), object(2)
memory usage: 755.7+ KB

In [207]:
from sklearn.preprocessing import StandardScaler,OneHotEncoder
from sklearn.pipeline import Pipeline

catc=["HomePlanet","Destination"]
numc=["Age","RoomService","FoodCourt","ShoppingMall","VRDeck","Spa"]
from sklearn.compose import ColumnTransformer

full_pipeline= ColumnTransformer([
   ("cat",OneHotEncoder(sparse=False,drop='first'),catc),
   ("num",StandardScaler(),numc)
])

In [208]:
y=df['Transported']
X=df.drop('Transported',axis=1)

In [209]:
clean_X=full_pipeline.fit_transform(X)
clean_X_t=full_pipeline.fit_transform(dft)

c:\Users\Jaya Teja\anaconda3\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(
c:\Users\Jaya Teja\anaconda3\Lib\site-packages\sklearn\preprocessing\_encoders.py:972: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

train data is clean_X,y
<br>
test data is clean_X_t,y_t